In [1]:
import pandas as pd
from pandas import Series
from pandas import DataFrame

import numpy as np

### Built-in functions

In [2]:
df = pd.read_csv("wages.csv")
df.head(2).T  # 데이터 head볼때 Transpose

                   0             1
earn    79571.299011  96396.988643
height         73.89         66.23
sex             male        female
race           white         white
ed                16            16
age               49            62

In [3]:
df.describe()  # 다양한 기본 통계량을 보여줍니다.

                earn       height           ed          age
count    1379.000000  1379.000000  1379.000000  1379.000000
mean    32446.292622    66.592640    13.354605    45.328499
std     31257.070006     3.818108     2.438741    15.789715
min       -98.580489    57.340000     3.000000    22.000000
25%     10538.790721    63.720000    12.000000    33.000000
50%     26877.870178    66.050000    13.000000    42.000000
75%     44506.215336    69.315000    15.000000    55.000000
max    317949.127955    77.210000    18.000000    95.000000

In [5]:
key = df.race.unique()
value = range(len(df.race.unique()))
df["race"].replace(to_replace=key, value=value)

0       0
1       0
2       0
3       1
4       0
       ..
1374    0
1375    0
1376    0
1377    0
1378    0
Name: race, Length: 1379, dtype: int64

In [6]:
sorted(df["race"].unique())

['black', 'hispanic', 'other', 'white']

In [7]:
# 그냥 enumerate 하고 dict 씌워준것
dict(enumerate(sorted(df["race"].unique())))

{0: 'black', 1: 'hispanic', 2: 'other', 3: 'white'}

In [8]:
print(np.array(list(enumerate(df["race"].unique()))))
print()

print(np.array(list(enumerate(df["race"].unique())))[:,0])

[['0' 'white']
 ['1' 'other']
 ['2' 'hispanic']
 ['3' 'black']]

['0' '1' '2' '3']

In [9]:
value = list(map(int, np.array(list(enumerate(df["race"].unique())))[:, 0].tolist()))
key = np.array(list(enumerate(df["race"].unique())), dtype=str)[:, 1].tolist()

value, key

([0, 1, 2, 3], ['white', 'other', 'hispanic', 'black'])

In [10]:
df['race']

0       white
1       white
2       white
3       other
4       white
        ...
1374    white
1375    white
1376    white
1377    white
1378    white
Name: race, Length: 1379, dtype: object

In [13]:
# inplace =True 이기 때문에 값이 직접 대입되었다.
df["race"].replace(to_replace=key, value=value, inplace=True)

In [14]:
df["race"]

0       0
1       0
2       0
3       1
4       0
       ..
1374    0
1375    0
1376    0
1377    0
1378    0
Name: race, Length: 1379, dtype: int64

In [15]:
value = list(map(int, np.array(list(enumerate(df["sex"].unique())))[:, 0].tolist()))
key = np.array(list(enumerate(df["sex"].unique())), dtype=str)[:, 1].tolist()

value, key

([0, 1], ['male', 'female'])

In [16]:
df["sex"]

0         male
1       female
2       female
3       female
4       female
         ...
1374      male
1375    female
1376    female
1377      male
1378      male
Name: sex, Length: 1379, dtype: object

In [17]:
df["sex"].replace(to_replace=key, value=value, inplace=True)
df.head(5)

           earn  height  sex  race  ed  age
0  79571.299011   73.89    0     0  16   49
1  96396.988643   66.23    1     0  16   62
2  48710.666947   63.77    1     0  16   33
3  80478.096153   63.22    1     1  16   95
4  82089.345498   63.08    1     0  17   43

In [18]:
numueric_cols = ["earn", "height", "ed", "age"]
df[numueric_cols].sum(axis=1)

0       79710.189011
1       96541.218643
2       48823.436947
3       80652.316153
4       82212.425498
            ...
1374    30290.060363
1375    25018.829514
1376    13823.311312
1377    95563.664410
1378     9686.681857
Length: 1379, dtype: float64

In [21]:
df.sum(axis=1)

0       79710.189011
1       96541.218643
2       48823.436947
3       80652.316153
4       82212.425498
            ...
1374    30290.060363
1375    25018.829514
1376    13823.311312
1377    95563.664410
1378     9686.681857
Length: 1379, dtype: float64

In [26]:
df.isnull().sum() / len(df)

earn      0.0
height    0.0
sex       0.0
race      0.0
ed        0.0
age       0.0
dtype: float64

In [36]:
pd.options.display.max_rows = 100

In [37]:
df.sort_values(["age", "earn"], ascending=True)

              earn  height     sex      race  ed  age
1038    -56.321979   67.81    male  hispanic  10   22
800     -27.876819   72.29    male     white  12   22
963     -25.655260   68.90    male     white  12   22
1105    988.565070   64.71  female     white  12   22
801    1000.221504   64.09  female     white  12   22
...            ...     ...     ...       ...  ..  ...
993   32809.632677   59.61  female     other  16   92
102   39751.194030   67.14    male     white  12   93
331   39169.750135   64.79  female     white  12   95
809   42963.362005   72.94    male     white  12   95
3     80478.096153   63.22  female     other  16   95

[1379 rows x 6 columns]

In [38]:
df.sort_values("age", ascending=False).head(10)

              earn  height     sex   race  ed  age
3     80478.096153   63.22  female  other  16   95
331   39169.750135   64.79  female  white  12   95
809   42963.362005   72.94    male  white  12   95
102   39751.194030   67.14    male  white  12   93
993   32809.632677   59.61  female  other  16   92
1017   8942.806716   62.97  female  white  10   91
1192  39757.947210   64.79    male  white  16   90
952    8162.682672   58.09  female  white   5   89
827   55712.348432   70.13    male  white   9   88
1068  10861.092284   64.03  female  white  13   87

In [39]:
df.age.corr(df.earn)  # 상관계수

0.07400349177836055

In [43]:
df.age[(df.age < 45) & (df.age > 15)].corr(df.earn)

0.31411788725189044

In [44]:
df.age.cov(df.earn)  # 공분산

36523.6992104089

In [48]:
df["sex_code"] = df["sex"].replace({"male": 1, "female": 0})

In [19]:
df.corr()

            earn    height       sex      race        ed       age
earn    1.000000  0.291600 -0.337328 -0.063977  0.350374  0.074003
height  0.291600  1.000000 -0.703672 -0.045974  0.114047 -0.133727
sex    -0.337328 -0.703672  1.000000  0.000858 -0.061747  0.070036
race   -0.063977 -0.045974  0.000858  1.000000 -0.049487 -0.056879
ed      0.350374  0.114047 -0.061747 -0.049487  1.000000 -0.129802
age     0.074003 -0.133727  0.070036 -0.056879 -0.129802  1.000000

- corrwith 메소드를 사용하면 해당 column에 대하여 vs 모든열 과의 상관계수를 출력해줍니다.

In [22]:
df.corrwith(df.earn)

earn      1.000000
height    0.291600
sex      -0.337328
race     -0.063977
ed        0.350374
age       0.074003
dtype: float64

In [23]:
df.sex.value_counts(sort=True)

1    859
0    520
Name: sex, dtype: int64